# !/usr/bin/env python
# -*- coding: utf-8 -*-
#
# Дан список с числами. Найти самую длинную последовательность.


def long_sequence(spec_str):
    N = len(spec_str)
    j = j_max = 1  # j_max размер максимальной последовательности

    for i in range(1, N):
        # пока i-й член на 1 больше предыдущего
        if spec_str[i] == spec_str[i - 1] + 1:
            j += 1
        else:
            if j > j_max:
                j_max = j
            j = 1

    for i in range(1, N):
        if spec_str[i] == spec_str[i - 1] + 1:
            j += 1
        else:
            if j == j_max:
                # тут print, а не return, на случай нескольких
                # последовательностей одинаковой длины
                print(spec_str[i-j:i])
            j = 1

long_sequence([
    1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23,
    24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 36, 37, 38, 39, 40, 42, 43, 44,
    45, 46, 47, 48, 49, 50, 51, 53, 54, 55, 57, 58, 60, 61, 62, 63, 64, 65, 67,
    68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 79, 80, 81, 83, 84, 85, 86, 87, 88,
    89, 90, 91, 93, 94, 95, 96, 97, 98, 99, 100])
